web/test/vcr_cassettes/subscription_renewed.yml

---
http_interactions:
- request:
    method: get
    uri: https://imazen-test.chargebee.com/api/v2/subscriptions/HtZEwKYQCgKZqsR1C
    body:
      encoding: US-ASCII
      string: ''
    headers:
      Accept:
      - application/json
      Accept-Encoding:
      - gzip, deflate
      User-Agent:
      - Chargebee-Ruby-Client v2.2.7
      Authorization:
      - Basic dGVzdF9iT0ozbm1RRmprZHV2UWNHMWNveEVZeHVxZFphWUpweDo=
  response:
    status:
      code: 200
      message: OK
    headers:
      Cache-Control:
      - no-store, no-cache, must-revalidate
      Content-Encoding:
      - gzip
      Content-Type:
      - application/json;charset=utf-8
      Date:
      - Wed, 24 Jul 2019 20:15:04 GMT
      Expires:
      - Thu, 01 Jan 1970 00:00:00 UTC
      Pragma:
      - no-cache
      Server:
      - ChargeBee
      Vary:
      - Accept-Encoding
      Content-Length:
      - '1135'
      Connection:
      - keep-alive
    body:
      encoding: ASCII-8BIT
      string: !binary |-
        H4sIAAAAAAAAAKVXTXPbNhC951d4eOw0HpKiSLGnTp20TtwmtRs3aS4YCFhKcEiQBkBbjMf/vQuQlkiK8kfLg0bUPiwWu/veQnevjvDxdL3UTInKiFJ6Px3duV+dRXB8907N17e3Z/+cn6zOvl7ri+DE+3EHYbU2ZQGKPANb5VR2OFHQFWR5eftaCwOvc8FAatgDX9dUGmEaXBKMbbUUhlQKV6I1jFLfHyNoUdbSTFiXIs+FXJEKlCj5yPnQ6LaxERelNOu9ADMF0I+yv4s21NTarqXMiJvB6YwSNCeIUNZ5EC0WUTgP03QPApK3gDSe4Uc6SL1SIA0xoIqdq3k8C6MkPozsPM7jeRrG/gAnYWPIw/mpOQRjCqgB3iGmYnfRPIpwKRl42T8gzTKRCwQRU34D25vebNH8LTfn4Vl6ebL5/MeF36is+sj4+nT95TJ5n8y8iTgzVRZEVHZ9EhyHweI4To6DyO9j64r3osEkpkESpP1yrqkmmq2B1zni2JrKFdjqZjTX0MMp0GWtGJAbULql1M5fmvRbjUMOuOmEk3J5Bcz13YCdezVlDWEltwzwLv9607fzGoiQNyXyQyOmJUL/PIVSE9SATXsyojAdNvTjAXGoBvLUziwjHZ87sge+n4RRlAbxARimdm2BcZpFPIJgEbEsyChbZD4kS3+G7TNLWZb6M2yjOI2oH/tLWESLiFIGwTxLEhayYFDQAgwlWFM6kDRn6qKaB2EYBlEQRvazt9aBDGiXf7pk3Nua7t23+xa7Fb8Xq2YmlDZE0sLl7wM1mHMKeR+S0x7ifSmx1/plKqjIrUX+LPlVcszKom+mtSmxPHmOTdS2oDfsHgmdGnDa6FFj0Bx1mXChcDHhsHT6N27QpzXgJewzdENRd1oNbd9yeISeEYpcEkf97SohCMuBKsenCcmd5OWDozBIXsjLbe0nRgflHHfT+533dN2frn2LEBICJ4hz/+hXPFchcjg6obIp5dEbNYazLrO/lHXOYc9sJxVs6XzycdLuTGVeKsrLPf9WX1TTisHY+L0t/sKf+eHYdkNzgZXFcpDduJSlIZ0BizBasavAONs7kva7kCrecw2bSqiBUw+vEAVVDaloU9gh2XVJy+KqIKFe/366/PLn+btPsb72N5+uB6u7VSg3a3eVuDsU7gg5lpumchm28Y5tCjKwivsQFE5D8u63uWp0ZuVFNd8v3u710AqTd0tdSVDR1QqWAAcwhDJXwM796rbnPQz59fnnq6mOGGZ0MvsVcr+01cWbDOoBF2YsNni2WnJL9wMAHEhY3IfqjK21tF3QzmPVzuPBNdClTln71NAairnN/EDIH22bJ/L733L7/weDEE7to8A+42WRm3sjg2PIQ/vdCE0H8WBxLMe27elqNJhENjUNaa/HKKnhvq1BVbZXDT9YTIjlIe14xogZToUphKh6Ynx4/kzNhq07f3BB6k2AIVW9gupvGIysi6W7Eng/9J69rL/kf9Pzlant6Ff3/wKqtgTA2w0AAA==
    http_version: 
  recorded_at: Wed, 24 Jul 2019 20:15:04 GMT
- request:
    method: get
    uri: https://imazen-test.chargebee.com/api/v2/customers/HtZEwKYQCgKZqsR1C
    body:
      encoding: US-ASCII
      string: ''
    headers:
      Accept:
      - application/json
      Accept-Encoding:
      - gzip, deflate
      User-Agent:
      - Chargebee-Ruby-Client v2.2.7
      Authorization:
      - Basic dGVzdF9iT0ozbm1RRmprZHV2UWNHMWNveEVZeHVxZFphWUpweDo=
  response:
    status:
      code: 200
      message: OK
    headers:
      Cache-Control:
      - no-store, no-cache, must-revalidate
      Content-Encoding:
      - gzip
      Content-Type:
      - application/json;charset=utf-8
      Date:
      - Wed, 24 Jul 2019 20:15:04 GMT
      Expires:
      - Thu, 01 Jan 1970 00:00:00 UTC
      Pragma:
      - no-cache
      Server:
      - ChargeBee
      Vary:
      - Accept-Encoding
      Content-Length:
      - '743'
      Connection:
      - keep-alive
    body:
      encoding: ASCII-8BIT
      string: !binary |-
        H4sIAAAAAAAAAKVWTXPTMBC991dkcmSYjO06H+XEkBZaygD9GqAXjWJtErWy5EhyErfT/44ku4nsOLSAD5mJ39Nq9d5q148HHfN0k1xpkYLsvus8ujfuLSXmf/dU356szn9djGfntwt1GY67b7eUKZVKI45TsNSvWM8xx8B8CsMe47PgoHwUUkyZRfh7Tu6GvUSkPoxzLVAiGINEU8Et0fx6BA4aaZApIrhQBg78xYyJFSJUmsWIwIRqQ5hipsAjJRKwBoKwBcN4NIqjfnR01MKYSpEimtkchmEvCke9wbAXxoGfjsZrPKGM6sLS3D8GPiHPiLddPx4cRsNB7G+XUYoSBliCkx+bgy9rISQokcsE0BKkKkXZBorCoUclwEC7OM1ji8mdUcVusPHeQ80RGOUzhAkxu6laWbzS95e9LxmUQ2jRw37Q+WjOlVIGnTHmheCdY9mkJ5WyH0TOCOzAShtxTb0Qt+H4WyvuIMGExETsxBc519JtcXPVBB9K80fBYRA1sSVm1Dhr7EB2k1y5mhYaVYAxobFi60BT7Q3vya9CLIkXGtYZlbWg3UzSFMsCZbhIgWtUVUl5i7MURWr+5XTy8/vF2fVALYL19aK2ulqVgp4Lsuv4Nt0Gs3EsXWROYZtvE5MwBQl8k5QW9+jsU18WamrbiyweLk92amhmxFthZ0kyx3IGE4A9HIQTZ2AVfrbyokcRWVz8uGuriLqirepn5u4L6y5myPQDQnWz2Ziz5ZzY676HAOvEmPvsThPNua0C0xjKMzbhzEknLZ5LK2GxqfKbq+My5yrfUvlaI/9j2byg779p+/+DgVLX7ePQPs1lsYWagLshz+W3pArX8jHm2Du2KU/nUW0SWWkKlAqu57alRrtYYbqygaIgHLU0y3294xUjpj4V2hg085rx/vnTNhs24YLALylvAtSvajfF6t4kw/N04j4Jum+8Z0f1anygV3wt/EVnKiv64Ok3+qDH1qEIAAA=
    http_version: 
  recorded_at: Wed, 24 Jul 2019 20:15:04 GMT
- request:
    method: get
    uri: https://imazen-test.chargebee.com/api/v2/plans/imageflow-site-license
    body:
      encoding: US-ASCII
      string: ''
    headers:
      Accept:
      - application/json
      Accept-Encoding:
      - gzip, deflate
      User-Agent:
      - Chargebee-Ruby-Client v2.2.7
      Authorization:
      - Basic dGVzdF9iT0ozbm1RRmprZHV2UWNHMWNveEVZeHVxZFphWUpweDo=
  response:
    status:
      code: 200
      message: OK
    headers:
      Cache-Control:
      - no-store, no-cache, must-revalidate
      Content-Type:
      - application/json;charset=utf-8
      Date:
      - Wed, 24 Jul 2019 20:15:04 GMT
      Expires:
      - Thu, 01 Jan 1970 00:00:00 UTC
      Pragma:
      - no-cache
      Server:
      - ChargeBee
      Content-Length:
      - '1170'
      Connection:
      - keep-alive
    body:
      encoding: UTF-8
      string: |-
        {"plan": {
            "id": "imageflow-site-license",
            "name": "Imageflow Site License",
            "invoice_name": "Imageflow Site License",
            "description": "Site-wide license for ImageResizer Elite Edition. Restricted to businesses with fewer than 500 employees.",
            "price": 24900,
            "period": 1,
            "period_unit": "month",
            "trial_period": 14,
            "trial_period_unit": "day",
            "pricing_model": "flat_fee",
            "free_quantity": 0,
            "status": "active",
            "enabled_in_hosted_pages": true,
            "enabled_in_portal": true,
            "addon_applicability": "all",
            "is_shippable": false,
            "updated_at": 1493880262,
            "giftable": false,
            "resource_version": 1493880262407,
            "object": "plan",
            "charge_model": "flat_fee",
            "taxable": true,
            "currency_code": "USD",
            "meta_data": {
                "kind": "oem",
                "is_public": true,
                "restrictions": "Single-product OEM redistribution. Only for organizations with fewer than 500 employees.",
                "features": [
                    "R_Elite",
                    "R_Creative",
                    "R_Performance"
                ],
                "network_grace_minutes": 720,
                "subscription_grace_minutes": 28800
            }
        }}
    http_version: 
  recorded_at: Wed, 24 Jul 2019 20:15:04 GMT
- request:
    method: get
    uri: https://imazen-test.chargebee.com/api/v2/subscriptions/HtZEwKYQCgKZqsR1C
    body:
      encoding: US-ASCII
      string: ''
    headers:
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
      Accept:
      - "*/*"
      User-Agent:
      - Ruby
      Authorization:
      - Basic dGVzdF9iT0ozbm1RRmprZHV2UWNHMWNveEVZeHVxZFphWUpweDo=
  response:
    status:
      code: 200
      message: OK
    headers:
      Cache-Control:
      - no-store, no-cache, must-revalidate
      Content-Type:
      - application/json;charset=utf-8
      Date:
      - Wed, 24 Jul 2019 20:15:04 GMT
      Expires:
      - Thu, 01 Jan 1970 00:00:00 UTC
      Pragma:
      - no-cache
      Server:
      - ChargeBee
      Vary:
      - Accept-Encoding
      Content-Length:
      - '1135'
      Connection:
      - keep-alive
    body:
      encoding: ASCII-8BIT
      string: |-
        {
            "subscription": {
                "id": "HtZEwKYQCgKZqsR1C",
                "customer_id": "HtZEwKYQCgKZqsR1C",
                "plan_id": "imageflow-site-license",
                "plan_quantity": 1,
                "plan_unit_price": 24900,
                "plan_amount": 24900,
                "billing_period": 1,
                "billing_period_unit": "month",
                "plan_free_quantity": 0,
                "status": "active",
                "trial_start": 1488425299,
                "trial_end": 1489634899,
                "current_term_start": 1563247699,
                "current_term_end": 1565926099,
                "next_billing_at": 1565926099,
                "created_at": 1488425299,
                "started_at": 1488425299,
                "activated_at": 1489634899,
                "affiliate_token": "38yVnxQ2K9UCxWMR0yrfpOcdhHhXU7J73",
                "created_from_ip": "71.218.67.140",
                "updated_at": 1563917190,
                "has_scheduled_changes": false,
                "resource_version": 1563917190971,
                "deleted": false,
                "object": "subscription",
                "currency_code": "USD",
                "due_invoices_count": 0,
                "mrr": 24900,
                "exchange_rate": 1.0,
                "base_currency_code": "USD",
                "cf_license_id": "1007244916",
                "cf_license_hash": "69f4d4e184cf1fac8f0e7b0384239cf903252694a060be8484aace15f77c2c10",
                "meta_data": {
                    "id": "151222141242141",
                    "test": "abcd"
                }
            },
            "customer": {
                "id": "HtZEwKYQCgKZqsR1C",
                "first_name": "Nathanael",
                "last_name": "Jones",
                "email": "n@ndj7.com",
                "auto_collection": "on",
                "net_term_days": 0,
                "allow_direct_debit": false,
                "created_at": 1488425299,
                "created_from_ip": "71.218.67.140",
                "taxability": "taxable",
                "updated_at": 1546327649,
                "pii_cleared": "active",
                "resource_version": 1546327649217,
                "deleted": false,
                "object": "customer",
                "billing_address": {
                    "first_name": "Nathanael",
                    "last_name": "Jones",
                    "line1": "350 Fourmile Canyon Dr",
                    "city": "Boulder",
                    "state_code": "CO",
                    "state": "Colorado",
                    "country": "US",
                    "zip": "80302",
                    "validation_status": "not_validated",
                    "object": "billing_address"
                },
                "card_status": "expired",
                "primary_payment_source_id": "pm_2shLHbXPQIT6sq0xTq",
                "payment_method": {
                    "object": "payment_method",
                    "type": "card",
                    "reference_id": "tok_IG5rysfQCgKryzREl",
                    "gateway": "chargebee",
                    "gateway_account_id": "gw_IG5rysfQCg22dqQWj",
                    "status": "expired"
                },
                "promotional_credits": 0,
                "refundable_credits": 0,
                "excess_payments": 0,
                "unbilled_charges": 0,
                "preferred_currency_code": "USD"
            },
            "card": {
                "status": "expired",
                "gateway": "chargebee",
                "gateway_account_id": "gw_IG5rysfQCg22dqQWj",
                "first_name": "Nathanael",
                "last_name": "Jones",
                "iin": "411111",
                "last4": "1111",
                "card_type": "visa",
                "funding_type": "credit",
                "expiry_month": 12,
                "expiry_year": 2018,
                "billing_country": "US",
                "created_at": 1488425299,
                "updated_at": 1488425299,
                "ip_address": "71.218.67.140",
                "resource_version": 1488425299000,
                "object": "card",
                "masked_number": "************1111",
                "customer_id": "HtZEwKYQCgKZqsR1C",
                "payment_source_id": "pm_2shLHbXPQIT6sq0xTq"
            }
        }
    http_version: 
  recorded_at: Wed, 24 Jul 2019 20:15:05 GMT
- request:
    method: post
    uri: https://imazen-test.chargebee.com/api/v2/subscriptions/HtZEwKYQCgKZqsR1C
    body:
      encoding: UTF-8
      string: id=HtZEwKYQCgKZqsR1C&customer_id=HtZEwKYQCgKZqsR1C&plan_id=imageflow-site-license&plan_quantity=1&plan_unit_price=24900&plan_amount=24900&billing_period=1&billing_period_unit=month&plan_free_quantity=0&status=active&trial_start=1488425299&current_term_start=1563247699&current_term_end=1565926099&next_billing_at=1565926099&created_at=1488425299&started_at=1488425299&activated_at=1489634899&affiliate_token=38yVnxQ2K9UCxWMR0yrfpOcdhHhXU7J73&created_from_ip=71.218.67.140&updated_at=1563917190&has_scheduled_changes=false&resource_version=1563917190971&deleted=false&object=subscription&currency_code=USD&due_invoices_count=0&mrr=24900&exchange_rate=1.0&base_currency_code=USD&cf_license_id=1007244916&cf_license_hash=7550d0716c5864c1613525a2cc5be83701c4ccf712bb1eff3deac2360c92f4c4&meta_data[id]=151222141242141&meta_data[test]=abcd
    headers:
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
      Accept:
      - "*/*"
      User-Agent:
      - Ruby
      Authorization:
      - Basic dGVzdF9iT0ozbm1RRmprZHV2UWNHMWNveEVZeHVxZFphWUpweDo=
  response:
    status:
      code: 200
      message: OK
    headers:
      Cache-Control:
      - no-store, no-cache, must-revalidate
      Content-Type:
      - application/json;charset=utf-8
      Date:
      - Wed, 24 Jul 2019 20:15:05 GMT
      Pragma:
      - no-cache
      Server:
      - ChargeBee
      Vary:
      - Accept-Encoding
      Content-Length:
      - '1146'
      Connection:
      - keep-alive
    body:
      encoding: ASCII-8BIT
      string: |-
        {
            "subscription": {
                "id": "HtZEwKYQCgKZqsR1C",
                "customer_id": "HtZEwKYQCgKZqsR1C",
                "plan_id": "imageflow-site-license",
                "plan_quantity": 1,
                "plan_unit_price": 24900,
                "plan_amount": 24900,
                "billing_period": 1,
                "billing_period_unit": "month",
                "plan_free_quantity": 0,
                "status": "active",
                "trial_start": 1488425299,
                "trial_end": 1489634899,
                "current_term_start": 1563247699,
                "current_term_end": 1565926099,
                "next_billing_at": 1565926099,
                "created_at": 1488425299,
                "started_at": 1488425299,
                "activated_at": 1489634899,
                "affiliate_token": "38yVnxQ2K9UCxWMR0yrfpOcdhHhXU7J73",
                "created_from_ip": "71.218.67.140",
                "updated_at": 1563999305,
                "has_scheduled_changes": false,
                "resource_version": 1563999305493,
                "deleted": false,
                "object": "subscription",
                "currency_code": "USD",
                "due_invoices_count": 0,
                "mrr": 24900,
                "exchange_rate": 1.0,
                "base_currency_code": "USD",
                "cf_license_id": "1007244916",
                "cf_license_hash": "7550d0716c5864c1613525a2cc5be83701c4ccf712bb1eff3deac2360c92f4c4",
                "meta_data": {
                    "id": "151222141242141",
                    "test": "abcd"
                }
            },
            "customer": {
                "id": "HtZEwKYQCgKZqsR1C",
                "first_name": "Nathanael",
                "last_name": "Jones",
                "email": "n@ndj7.com",
                "auto_collection": "on",
                "net_term_days": 0,
                "allow_direct_debit": false,
                "created_at": 1488425299,
                "created_from_ip": "71.218.67.140",
                "taxability": "taxable",
                "updated_at": 1546327649,
                "pii_cleared": "active",
                "resource_version": 1546327649217,
                "deleted": false,
                "object": "customer",
                "billing_address": {
                    "first_name": "Nathanael",
                    "last_name": "Jones",
                    "line1": "350 Fourmile Canyon Dr",
                    "city": "Boulder",
                    "state_code": "CO",
                    "state": "Colorado",
                    "country": "US",
                    "zip": "80302",
                    "validation_status": "not_validated",
                    "object": "billing_address"
                },
                "card_status": "expired",
                "primary_payment_source_id": "pm_2shLHbXPQIT6sq0xTq",
                "payment_method": {
                    "object": "payment_method",
                    "type": "card",
                    "reference_id": "tok_IG5rysfQCgKryzREl",
                    "gateway": "chargebee",
                    "gateway_account_id": "gw_IG5rysfQCg22dqQWj",
                    "status": "expired"
                },
                "promotional_credits": 0,
                "refundable_credits": 0,
                "excess_payments": 0,
                "unbilled_charges": 0,
                "preferred_currency_code": "USD"
            },
            "card": {
                "status": "expired",
                "gateway": "chargebee",
                "gateway_account_id": "gw_IG5rysfQCg22dqQWj",
                "first_name": "Nathanael",
                "last_name": "Jones",
                "iin": "411111",
                "last4": "1111",
                "card_type": "visa",
                "funding_type": "credit",
                "expiry_month": 12,
                "expiry_year": 2018,
                "billing_country": "US",
                "created_at": 1488425299,
                "updated_at": 1488425299,
                "ip_address": "71.218.67.140",
                "resource_version": 1488425299000,
                "object": "card",
                "masked_number": "************1111",
                "customer_id": "HtZEwKYQCgKZqsR1C",
                "payment_source_id": "pm_2shLHbXPQIT6sq0xTq"
            },
            "credit_notes": []
        }
    http_version: 
  recorded_at: Wed, 24 Jul 2019 20:15:06 GMT
- request:
    method: put
    uri: https://s3-us-west-2.amazonaws.com/licenses.imazen.net/v1/licenses/latest/e6e51797015f85e9b99fabaf5a00536f00e21ed31629551732d3f2108d55b0cd.txt
    body:
      encoding: US-ASCII
      string: ''
    headers:
      User-Agent:
      - fog-core/1.45.0
      Content-Type:
      - text/plain; charset=utf-8
      X-Amz-Acl:
      - public-read
      X-Amz-Date:
      - 20190724T201506Z
      X-Amz-Content-Sha256:
      - STREAMING-AWS4-HMAC-SHA256-PAYLOAD
      X-Amz-Decoded-Content-Length:
      - '850'
      Authorization:
      - AWS4-HMAC-SHA256 Credential=AKIAICS7RGGEDL62367A/20190724/us-west-2/s3/aws4_request,
        SignedHeaders=content-type;host;x-amz-acl;x-amz-content-sha256;x-amz-date;x-amz-decoded-content-length,
        Signature=3cb12a9937b87317a2b0e2183302d5475ece892c8fb06da73baf241e232dad5b
  response:
    status:
      code: 200
      message: OK
    headers:
      X-Amz-Id-2:
      - lZaijPC9szdYnTc0tSS1wOl/Y1QYCaILTN6G0kLnqIPPuas0tRsxbyhbb5owX7L26IHgXY3AKHk=
      X-Amz-Request-Id:
      - 1D7D70A97167C569
      Date:
      - Wed, 24 Jul 2019 20:15:07 GMT
      X-Amz-Version-Id:
      - i7HLbjiMA7NfpVD40ks6pF1Cx3yxJoZC
      Etag:
      - '"5ccc4c314f5435b8946c4730a4ef0fc7"'
      Content-Length:
      - '0'
      Server:
      - AmazonS3
    body:
      encoding: ASCII-8BIT
      string: ''
    http_version: 
  recorded_at: Wed, 24 Jul 2019 20:15:06 GMT
recorded_with: VCR 5.0.0
