spec/fixtures/chargebee/subscription_changed.json

{
  "id": "ev_3Nl8KVbQ42MTbq3F",
  "occurred_at": 1362310365,
  "source": "admin_console",
  "object": "event",
  "api_version": "v2",
  "content": {
    "subscription": {
      "id": "IG5ryl2QIcaZIV7QP",
      "customer_id": "2smoc97nQIcYnlI7vs",
      "plan_id": "no_trial",
      "plan_quantity": 1,
      "status": "active",
      "trial_start": 1341747135,
      "trial_end": 1344425535,
      "current_term_start": 1362223962,
      "current_term_end": 1364902362,
      "created_at": 1341142335,
      "started_at": 1341747135,
      "activated_at": 1362223962,
      "updated_at": 1362310365,
      "has_scheduled_changes": false,
      "resource_version": 1362310365000,
      "deleted": false,
      "object": "subscription",
      "currency_code": "USD",
      "addons": [
        {
          "id": "data_usage",
          "quantity": 1,
          "object": "addon"
        }
      ],
      "due_invoices_count": 0,
      "mrr": 995,
      "exchange_rate": 1.0,
      "base_currency_code": "USD"
    },
    "customer": {
      "id": "2smoc97nQIcYnlI7vs",
      "first_name": "Benjamin",
      "last_name": "Ross",
      "email": "Benjamin@test.com",
      "auto_collection": "on",
      "net_term_days": 0,
      "allow_direct_debit": false,
      "created_at": 1341142335,
      "taxability": "taxable",
      "updated_at": 1362310365,
      "resource_version": 1362310365000,
      "deleted": false,
      "object": "customer",
      "card_status": "valid",
      "payment_method": {
        "object": "payment_method",
        "type": "card",
        "reference_id": "tok_3Nl8KVbQ42MSSh1b",
        "gateway": "chargebee",
        "status": "valid"
      },
      "promotional_credits": 0,
      "refundable_credits": 871,
      "excess_payments": 0
    },
    "invoice": {
      "id": "draft_inv_3Nl8KVbQ42MTZm3B",
      "customer_id": "3Nl8KVbQ42MLmI5",
      "subscription_id": "3Nl8KVbQ42MLmI5",
      "recurring": true,
      "status": "pending",
      "price_type": "tax_exclusive",
      "date": 1362310365,
      "net_term_days": 0,
      "exchange_rate": 1.0,
      "total": 968,
      "amount_paid": 0,
      "amount_adjusted": 0,
      "write_off_amount": 0,
      "credits_applied": 0,
      "amount_due": 968,
      "updated_at": 1362310365,
      "resource_version": 1362310365000,
      "deleted": false,
      "object": "invoice",
      "first_invoice": false,
      "currency_code": "USD",
      "base_currency_code": "USD",
      "tax": 0,
      "line_items": [
        {
          "id": "li_3Nl8KVbQ42MTVN38",
          "date_from": 1362310365,
          "date_to": 1364902362,
          "unit_amount": 968,
          "quantity": 1,
          "is_taxed": false,
          "tax_amount": 0,
          "object": "line_item",
          "amount": 968,
          "description": "No Trial - Prorated Charges",
          "entity_type": "plan",
          "entity_id": "no_trial",
          "discount_amount": 0,
          "item_level_discount_amount": 0
        }
      ],
      "sub_total": 968,
      "linked_payments": null,
      "applied_credits": null,
      "adjustment_credit_notes": null,
      "issued_credit_notes": null,
      "linked_orders": null
    },
    "credit_notes": [
      {
        "id": "TEST-CN-1",
        "customer_id": "3Nl8KVbQ42MLmI5",
        "subscription_id": "3Nl8KVbQ42MLmI5",
        "reference_invoice_id": "3",
        "type": "refundable",
        "reason_code": "subscription_change",
        "status": "refund_due",
        "date": 1362310365,
        "price_type": "tax_exclusive",
        "exchange_rate": 1.0,
        "total": 871,
        "amount_allocated": 0,
        "amount_refunded": 0,
        "amount_available": 871,
        "updated_at": 1362310365,
        "resource_version": 1362310365000,
        "deleted": false,
        "object": "credit_note",
        "currency_code": "USD",
        "base_currency_code": "USD",
        "sub_total": 871,
        "line_items": [
          {
            "id": "li_3Nl8KVbQ42MTWH3A",
            "date_from": 1362310365,
            "date_to": 1364902362,
            "unit_amount": 871,
            "quantity": 1,
            "is_taxed": false,
            "tax_amount": 0,
            "object": "line_item",
            "amount": 871,
            "description": "Basic - Prorated Credits for 03-Mar-2013 - 02-Apr-2013",
            "entity_type": "plan",
            "entity_id": "basic",
            "discount_amount": 0,
            "item_level_discount_amount": 0
          }
        ],
        "taxes": null,
        "line_item_taxes": null,
        "linked_refunds": null,
        "allocations": null
      }
    ]
  },
  "event_type": "subscription_changed",
  "webhook_status": "not_configured",
  "controller": "chargebee",
  "action": "index",
  "chargebee": {
    "id": "ev_3Nl8KVbQ42MTbq3F",
    "occurred_at": 1362310365,
    "source": "admin_console",
    "object": "event",
    "api_version": "v2",
    "content": {
      "subscription": {
        "id": "3Nl8KVbQ42MLmI5",
        "customer_id": "3Nl8KVbQ42MLmI5",
        "plan_id": "no_trial",
        "plan_quantity": 1,
        "status": "active",
        "trial_start": 1341747135,
        "trial_end": 1344425535,
        "current_term_start": 1362223962,
        "current_term_end": 1364902362,
        "created_at": 1341142335,
        "started_at": 1341747135,
        "activated_at": 1362223962,
        "updated_at": 1362310365,
        "has_scheduled_changes": false,
        "resource_version": 1362310365000,
        "deleted": false,
        "object": "subscription",
        "currency_code": "USD",
        "addons": [
          {
            "id": "data_usage",
            "quantity": 1,
            "object": "addon"
          }
        ],
        "due_invoices_count": 0,
        "mrr": 995,
        "exchange_rate": 1.0,
        "base_currency_code": "USD"
      },
      "customer": {
        "id": "3Nl8KVbQ42MLmI5",
        "first_name": "Benjamin",
        "last_name": "Ross",
        "email": "Benjamin@test.com",
        "auto_collection": "on",
        "net_term_days": 0,
        "allow_direct_debit": false,
        "created_at": 1341142335,
        "taxability": "taxable",
        "updated_at": 1362310365,
        "resource_version": 1362310365000,
        "deleted": false,
        "object": "customer",
        "card_status": "valid",
        "payment_method": {
          "object": "payment_method",
          "type": "card",
          "reference_id": "tok_3Nl8KVbQ42MSSh1b",
          "gateway": "chargebee",
          "status": "valid"
        },
        "promotional_credits": 0,
        "refundable_credits": 871,
        "excess_payments": 0
      },
      "invoice": {
        "id": "draft_inv_3Nl8KVbQ42MTZm3B",
        "customer_id": "3Nl8KVbQ42MLmI5",
        "subscription_id": "3Nl8KVbQ42MLmI5",
        "recurring": true,
        "status": "pending",
        "price_type": "tax_exclusive",
        "date": 1362310365,
        "net_term_days": 0,
        "exchange_rate": 1.0,
        "total": 968,
        "amount_paid": 0,
        "amount_adjusted": 0,
        "write_off_amount": 0,
        "credits_applied": 0,
        "amount_due": 968,
        "updated_at": 1362310365,
        "resource_version": 1362310365000,
        "deleted": false,
        "object": "invoice",
        "first_invoice": false,
        "currency_code": "USD",
        "base_currency_code": "USD",
        "tax": 0,
        "line_items": [
          {
            "id": "li_3Nl8KVbQ42MTVN38",
            "date_from": 1362310365,
            "date_to": 1364902362,
            "unit_amount": 968,
            "quantity": 1,
            "is_taxed": false,
            "tax_amount": 0,
            "object": "line_item",
            "amount": 968,
            "description": "No Trial - Prorated Charges",
            "entity_type": "plan",
            "entity_id": "no_trial",
            "discount_amount": 0,
            "item_level_discount_amount": 0
          }
        ],
        "sub_total": 968,
        "linked_payments": null,
        "applied_credits": null,
        "adjustment_credit_notes": null,
        "issued_credit_notes": null,
        "linked_orders": null
      },
      "credit_notes": [
        {
          "id": "TEST-CN-1",
          "customer_id": "3Nl8KVbQ42MLmI5",
          "subscription_id": "3Nl8KVbQ42MLmI5",
          "reference_invoice_id": "3",
          "type": "refundable",
          "reason_code": "subscription_change",
          "status": "refund_due",
          "date": 1362310365,
          "price_type": "tax_exclusive",
          "exchange_rate": 1.0,
          "total": 871,
          "amount_allocated": 0,
          "amount_refunded": 0,
          "amount_available": 871,
          "updated_at": 1362310365,
          "resource_version": 1362310365000,
          "deleted": false,
          "object": "credit_note",
          "currency_code": "USD",
          "base_currency_code": "USD",
          "sub_total": 871,
          "line_items": [
            {
              "id": "li_3Nl8KVbQ42MTWH3A",
              "date_from": 1362310365,
              "date_to": 1364902362,
              "unit_amount": 871,
              "quantity": 1,
              "is_taxed": false,
              "tax_amount": 0,
              "object": "line_item",
              "amount": 871,
              "description": "Basic - Prorated Credits for 03-Mar-2013 - 02-Apr-2013",
              "entity_type": "plan",
              "entity_id": "basic",
              "discount_amount": 0,
              "item_level_discount_amount": 0
            }
          ],
          "taxes": null,
          "line_item_taxes": null,
          "linked_refunds": null,
          "allocations": null
        }
      ]
    },
    "event_type": "subscription_changed",
    "webhook_status": "not_configured"
  }
}