web/test/fixtures/chargebee/subscription_reactivated.json

{
  "id": "ev_3Nl8KVbQ42MTMf2z",
  "occurred_at": 1362223962,
  "source": "admin_console",
  "object": "event",
  "api_version": "v2",
  "content": {
    "subscription": {
      "id": "IG5ryl2QIcaZIV7QP",
      "customer_id": "2smoc97nQIcYnlI7vs",
      "plan_id": "basic",
      "plan_quantity": 1,
      "status": "active",
      "trial_start": 1341747135,
      "trial_end": 1344425535,
      "current_term_start": 1362223962,
      "current_term_end": 1364902362,
      "created_at": 1341142335,
      "started_at": 1341747135,
      "activated_at": 1362223962,
      "updated_at": 1362223962,
      "has_scheduled_changes": false,
      "resource_version": 1362223962000,
      "deleted": false,
      "object": "subscription",
      "currency_code": "USD",
      "addons": [
        {
          "id": "data_usage",
          "quantity": 1,
          "object": "addon"
        }
      ],
      "due_invoices_count": 0,
      "mrr": 995,
      "exchange_rate": 1.0,
      "base_currency_code": "USD"
    },
    "customer": {
      "id": "3Nl8KVbQ42MLmI5",
      "first_name": "Benjamin",
      "last_name": "Ross",
      "email": "Benjamin@test.com",
      "auto_collection": "on",
      "net_term_days": 0,
      "allow_direct_debit": false,
      "created_at": 1341142335,
      "taxability": "taxable",
      "updated_at": 1349177560,
      "resource_version": 1349177560000,
      "deleted": false,
      "object": "customer",
      "card_status": "valid",
      "payment_method": {
        "object": "payment_method",
        "type": "card",
        "reference_id": "tok_3Nl8KVbQ42MSSh1b",
        "gateway": "chargebee",
        "status": "valid"
      },
      "promotional_credits": 0,
      "refundable_credits": 0,
      "excess_payments": 0
    },
    "invoice": {
      "id": "3",
      "customer_id": "3Nl8KVbQ42MLmI5",
      "subscription_id": "3Nl8KVbQ42MLmI5",
      "recurring": true,
      "status": "paid",
      "price_type": "tax_exclusive",
      "date": 1362223962,
      "due_date": 1362223962,
      "net_term_days": 0,
      "exchange_rate": 1.0,
      "total": 995,
      "amount_paid": 995,
      "amount_adjusted": 0,
      "write_off_amount": 0,
      "credits_applied": 0,
      "amount_due": 0,
      "paid_at": 1362223962,
      "updated_at": 1362223962,
      "resource_version": 1362223962000,
      "deleted": false,
      "object": "invoice",
      "first_invoice": false,
      "currency_code": "USD",
      "base_currency_code": "USD",
      "tax": 0,
      "line_items": [
        {
          "id": "li_3Nl8KVbQ42MTJI2s",
          "date_from": 1362223962,
          "date_to": 1364902362,
          "unit_amount": 900,
          "quantity": 1,
          "is_taxed": false,
          "tax_amount": 0,
          "object": "line_item",
          "amount": 900,
          "description": "Basic",
          "entity_type": "plan",
          "entity_id": "basic",
          "discount_amount": 0,
          "item_level_discount_amount": 0
        },
        {
          "id": "li_3Nl8KVbQ42MTJV2t",
          "date_from": 1362223962,
          "date_to": 1364902362,
          "unit_amount": 95,
          "quantity": 1,
          "is_taxed": false,
          "tax_amount": 0,
          "object": "line_item",
          "amount": 95,
          "description": "Data Usage",
          "entity_type": "addon",
          "entity_id": "data_usage",
          "discount_amount": 0,
          "item_level_discount_amount": 0
        }
      ],
      "sub_total": 995,
      "linked_payments": [
        {
          "txn_id": "txn_3Nl8KVbQ42MTKF2u",
          "applied_amount": 995,
          "applied_at": 1362223962,
          "txn_status": "success",
          "txn_date": 1362223962,
          "txn_amount": 995
        }
      ],
      "applied_credits": null,
      "adjustment_credit_notes": null,
      "issued_credit_notes": null,
      "linked_orders": null,
      "billing_address": {
        "first_name": "Benjamin",
        "last_name": "Ross",
        "validation_status": "not_validated",
        "object": "billing_address"
      }
    }
  },
  "event_type": "subscription_reactivated",
  "webhook_status": "not_configured",
  "controller": "chargebee",
  "action": "index",
  "chargebee": {
    "id": "ev_3Nl8KVbQ42MTMf2z",
    "occurred_at": 1362223962,
    "source": "admin_console",
    "object": "event",
    "api_version": "v2",
    "content": {
      "subscription": {
        "id": "3Nl8KVbQ42MLmI5",
        "customer_id": "3Nl8KVbQ42MLmI5",
        "plan_id": "basic",
        "plan_quantity": 1,
        "status": "active",
        "trial_start": 1341747135,
        "trial_end": 1344425535,
        "current_term_start": 1362223962,
        "current_term_end": 1364902362,
        "created_at": 1341142335,
        "started_at": 1341747135,
        "activated_at": 1362223962,
        "updated_at": 1362223962,
        "has_scheduled_changes": false,
        "resource_version": 1362223962000,
        "deleted": false,
        "object": "subscription",
        "currency_code": "USD",
        "addons": [
          {
            "id": "data_usage",
            "quantity": 1,
            "object": "addon"
          }
        ],
        "due_invoices_count": 0,
        "mrr": 995,
        "exchange_rate": 1.0,
        "base_currency_code": "USD"
      },
      "customer": {
        "id": "3Nl8KVbQ42MLmI5",
        "first_name": "Benjamin",
        "last_name": "Ross",
        "email": "Benjamin@test.com",
        "auto_collection": "on",
        "net_term_days": 0,
        "allow_direct_debit": false,
        "created_at": 1341142335,
        "taxability": "taxable",
        "updated_at": 1349177560,
        "resource_version": 1349177560000,
        "deleted": false,
        "object": "customer",
        "card_status": "valid",
        "payment_method": {
          "object": "payment_method",
          "type": "card",
          "reference_id": "tok_3Nl8KVbQ42MSSh1b",
          "gateway": "chargebee",
          "status": "valid"
        },
        "promotional_credits": 0,
        "refundable_credits": 0,
        "excess_payments": 0
      },
      "invoice": {
        "id": "3",
        "customer_id": "3Nl8KVbQ42MLmI5",
        "subscription_id": "3Nl8KVbQ42MLmI5",
        "recurring": true,
        "status": "paid",
        "price_type": "tax_exclusive",
        "date": 1362223962,
        "due_date": 1362223962,
        "net_term_days": 0,
        "exchange_rate": 1.0,
        "total": 995,
        "amount_paid": 995,
        "amount_adjusted": 0,
        "write_off_amount": 0,
        "credits_applied": 0,
        "amount_due": 0,
        "paid_at": 1362223962,
        "updated_at": 1362223962,
        "resource_version": 1362223962000,
        "deleted": false,
        "object": "invoice",
        "first_invoice": false,
        "currency_code": "USD",
        "base_currency_code": "USD",
        "tax": 0,
        "line_items": [
          {
            "id": "li_3Nl8KVbQ42MTJI2s",
            "date_from": 1362223962,
            "date_to": 1364902362,
            "unit_amount": 900,
            "quantity": 1,
            "is_taxed": false,
            "tax_amount": 0,
            "object": "line_item",
            "amount": 900,
            "description": "Basic",
            "entity_type": "plan",
            "entity_id": "basic",
            "discount_amount": 0,
            "item_level_discount_amount": 0
          },
          {
            "id": "li_3Nl8KVbQ42MTJV2t",
            "date_from": 1362223962,
            "date_to": 1364902362,
            "unit_amount": 95,
            "quantity": 1,
            "is_taxed": false,
            "tax_amount": 0,
            "object": "line_item",
            "amount": 95,
            "description": "Data Usage",
            "entity_type": "addon",
            "entity_id": "data_usage",
            "discount_amount": 0,
            "item_level_discount_amount": 0
          }
        ],
        "sub_total": 995,
        "linked_payments": [
          {
            "txn_id": "txn_3Nl8KVbQ42MTKF2u",
            "applied_amount": 995,
            "applied_at": 1362223962,
            "txn_status": "success",
            "txn_date": 1362223962,
            "txn_amount": 995
          }
        ],
        "applied_credits": null,
        "adjustment_credit_notes": null,
        "issued_credit_notes": null,
        "linked_orders": null,
        "billing_address": {
          "first_name": "Benjamin",
          "last_name": "Ross",
          "validation_status": "not_validated",
          "object": "billing_address"
        }
      }
    },
    "event_type": "subscription_reactivated",
    "webhook_status": "not_configured"
  }
}