web/test/fixtures/chargebee/subscription_renewed.json

{"id":"ev_2rprAVXaQGvSWjH3N7q","occurred_at":1492313300,"source":"scheduled_job","object":"event","api_version":"v2","content":{"subscription":{"id":"HtZEwKYQCgKZqsR1C","customer_id":"HtZEwKYQCgKZqsR1C","plan_id":"imageflow-site-license","plan_quantity":1,"plan_unit_price":24900,"billing_period":1,"billing_period_unit":"month","plan_free_quantity":0,"status":"active","trial_start":1488425299,"trial_end":1489634899,"current_term_start":1492313299,"current_term_end":1494905299,"next_billing_at":1494905299,"created_at":1488425299,"started_at":1488425299,"activated_at":1489634899,"affiliate_token":"38yVnxQ2K9UCxWMR0yrfpOcdhHhXU7J73","created_from_ip":"71.218.67.140","updated_at":1492313300,"has_scheduled_changes":false,"resource_version":1492313300606,"deleted":false,"object":"subscription","currency_code":"USD","due_invoices_count":0,"mrr":24900,"exchange_rate":1.0,"base_currency_code":"USD"},"customer":{"id":"HtZEwKYQCgKZqsR1C","first_name":"Nathanael","last_name":"Jones","email":"n@ndj7.com","auto_collection":"on","net_term_days":0,"allow_direct_debit":false,"created_at":1488425299,"created_from_ip":"71.218.67.140","taxability":"taxable","updated_at":1488425299,"resource_version":1488425299360,"deleted":false,"object":"customer","billing_address":{"first_name":"Nathanael","last_name":"Jones","line1":"350 Fourmile Canyon Dr","city":"Boulder","state_code":"CO","state":"Colorado","country":"US","zip":"80302","validation_status":"not_validated","object":"billing_address"},"card_status":"valid","payment_method":{"object":"payment_method","type":"card","reference_id":"tok_IG5rysfQCgKryzREl","gateway":"chargebee","gateway_account_id":"gw_IG5rysfQCg22dqQWj","status":"valid"},"promotional_credits":0,"refundable_credits":0,"excess_payments":0},"invoice":{"id":"2","customer_id":"HtZEwKYQCgKZqsR1C","subscription_id":"HtZEwKYQCgKZqsR1C","recurring":true,"status":"paid","price_type":"tax_exclusive","date":1492313299,"due_date":1492313299,"net_term_days":0,"exchange_rate":1.0,"total":24900,"amount_paid":24900,"amount_adjusted":0,"write_off_amount":0,"credits_applied":0,"amount_due":0,"paid_at":1492313300,"updated_at":1492313300,"resource_version":1492313300596,"deleted":false,"object":"invoice","first_invoice":false,"has_advance_charges":false,"currency_code":"USD","base_currency_code":"USD","tax":0,"line_items":[{"id":"li_2rprAVXaQGvSWh43N7k","date_from":1492313299,"date_to":1494905299,"unit_amount":24900,"quantity":1,"is_taxed":false,"tax_amount":0,"object":"line_item","amount":24900,"description":"Imageflow Site License","entity_type":"plan","entity_id":"imageflow-site-license","tax_exempt_reason":"tax_not_configured","discount_amount":0,"item_level_discount_amount":0}],"sub_total":24900,"linked_payments":[{"txn_id":"txn_2rprAVXaQGvSWhp3N7l","applied_amount":24900,"applied_at":1492313300,"txn_status":"success","txn_date":1492313300,"txn_amount":24900}],"applied_credits":null,"adjustment_credit_notes":null,"issued_credit_notes":null,"linked_orders":null,"billing_address":{"first_name":"Nathanael","last_name":"Jones","line1":"350 Fourmile Canyon Dr","city":"Boulder","state_code":"CO","state":"Colorado","country":"US","zip":"80302","validation_status":"not_validated","object":"billing_address"}}},"event_type":"subscription_renewed","webhook_status":"failed","webhook_failure_reason":"Received error code 502 from server. Your server has returned internal server error code. Please check the server logs","webhooks":[{"id":"whv2_Hr5514JQGRFKXV1Meh","webhook_status":"failed","object":"webhook"}],"controller":"chargebee","action":"index","chargebee":{"id":"ev_2rprAVXaQGvSWjH3N7q","occurred_at":1492313300,"source":"scheduled_job","object":"event","api_version":"v2","content":{"subscription":{"id":"HtZEwKYQCgKZqsR1C","customer_id":"HtZEwKYQCgKZqsR1C","plan_id":"imageflow-site-license","plan_quantity":1,"plan_unit_price":24900,"billing_period":1,"billing_period_unit":"month","plan_free_quantity":0,"status":"active","trial_start":1488425299,"trial_end":1489634899,"current_term_start":1492313299,"current_term_end":1494905299,"next_billing_at":1494905299,"created_at":1488425299,"started_at":1488425299,"activated_at":1489634899,"affiliate_token":"38yVnxQ2K9UCxWMR0yrfpOcdhHhXU7J73","created_from_ip":"71.218.67.140","updated_at":1492313300,"has_scheduled_changes":false,"resource_version":1492313300606,"deleted":false,"object":"subscription","currency_code":"USD","due_invoices_count":0,"mrr":24900,"exchange_rate":1.0,"base_currency_code":"USD"},"customer":{"id":"HtZEwKYQCgKZqsR1C","first_name":"Nathanael","last_name":"Jones","email":"n@ndj7.com","auto_collection":"on","net_term_days":0,"allow_direct_debit":false,"created_at":1488425299,"created_from_ip":"71.218.67.140","taxability":"taxable","updated_at":1488425299,"resource_version":1488425299360,"deleted":false,"object":"customer","billing_address":{"first_name":"Nathanael","last_name":"Jones","line1":"350 Fourmile Canyon Dr","city":"Boulder","state_code":"CO","state":"Colorado","country":"US","zip":"80302","validation_status":"not_validated","object":"billing_address"},"card_status":"valid","payment_method":{"object":"payment_method","type":"card","reference_id":"tok_IG5rysfQCgKryzREl","gateway":"chargebee","gateway_account_id":"gw_IG5rysfQCg22dqQWj","status":"valid"},"promotional_credits":0,"refundable_credits":0,"excess_payments":0},"invoice":{"id":"2","customer_id":"HtZEwKYQCgKZqsR1C","subscription_id":"HtZEwKYQCgKZqsR1C","recurring":true,"status":"paid","price_type":"tax_exclusive","date":1492313299,"due_date":1492313299,"net_term_days":0,"exchange_rate":1.0,"total":24900,"amount_paid":24900,"amount_adjusted":0,"write_off_amount":0,"credits_applied":0,"amount_due":0,"paid_at":1492313300,"updated_at":1492313300,"resource_version":1492313300596,"deleted":false,"object":"invoice","first_invoice":false,"has_advance_charges":false,"currency_code":"USD","base_currency_code":"USD","tax":0,"line_items":[{"id":"li_2rprAVXaQGvSWh43N7k","date_from":1492313299,"date_to":1494905299,"unit_amount":24900,"quantity":1,"is_taxed":false,"tax_amount":0,"object":"line_item","amount":24900,"description":"Imageflow Site License","entity_type":"plan","entity_id":"imageflow-site-license","tax_exempt_reason":"tax_not_configured","discount_amount":0,"item_level_discount_amount":0}],"sub_total":24900,"linked_payments":[{"txn_id":"txn_2rprAVXaQGvSWhp3N7l","applied_amount":24900,"applied_at":1492313300,"txn_status":"success","txn_date":1492313300,"txn_amount":24900}],"applied_credits":null,"adjustment_credit_notes":null,"issued_credit_notes":null,"linked_orders":null,"billing_address":{"first_name":"Nathanael","last_name":"Jones","line1":"350 Fourmile Canyon Dr","city":"Boulder","state_code":"CO","state":"Colorado","country":"US","zip":"80302","validation_status":"not_validated","object":"billing_address"}}},"event_type":"subscription_renewed","webhook_status":"failed","webhook_failure_reason":"Received error code 502 from server. Your server has returned internal server error code. Please check the server logs","webhooks":[{"id":"whv2_Hr5514JQGRFKXV1Meh","webhook_status":"failed","object":"webhook"}]}}